---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Stairs.GetStairsLandings
zh: 楼梯
source: html/675ad372-825f-7e26-d2ed-147abc85f726.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.GetStairsLandings Method

**中文**: 楼梯

Returns all the stairs landing components in the stairs.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetStairsLandings()
```

## Returns
The stairs landing components in the stairs.